<template>
  <div class="rt-container">
    <div class="app-content rt-col-12 rt-col-md-3">
      <div class="app-title">
        <div class="row">
          <h1 class="rt-font-hero rt-col">
            Annotation
          </h1>
        </div>
      </div>
      <div class="app-body">
        <div class="row sp-b-2">
            <pre-code text="<div class='rt-col-7 rt-col-td-6'>
              <rt-annotation :scroll-timeout='1000' :v2='true'>
                <template slot='label'>Что такое ОС Аврора?</template>
                <template slot='content'>
                  <p class='rt-font-small-paragraph'>ОС Аврора — первая и пока единственная российская операционная система,
                  которая позволяет удаленно контролировать процесс обработки данных на мобильных устройствах.</p>
                </template>
              </rt-annotation>
              <rt-annotation :scroll-timeout='1000' :v2='true'>
                <template slot='label'>Как происходит управление мобильными устройствами?</template>
                <template slot='content'>
                  <p class='rt-font-small-paragraph'>ОС Аврора — первая и пока единственная российская операционная система,
                    которая позволяет удаленно контролировать процесс обработки данных на мобильных устройствах.</p>
                </template>
              </rt-annotation>
              <rt-annotation :scroll-timeout='1000' :v2='true'>
                <template slot='label'>В чем преимущества работы операционной системы «Аврора» и почему важно
                  формирование доверенной мобильной среды в крупной компании?</template>
                <template slot='content'>
                  <p class='rt-font-small-paragraph'>У операционной системы «Аврора» есть ряд преимуществ, которые
                  позволяют использовать мобильные устройства как мобильное рабочее место. При этом обеспечить
                  зашифрованный доступ к информационным системам, поддержку работы в системе электронного
                  документооборота и корпоративном облаке с использованием электронной подписи. Основные преимущества ОС Аврора:</p>
                  <ul class='rt-numeric-list sp-v-1'>
                    <li class='rt-numeric-list__item'>
                      <p class='rt-font-small-paragraph sp-b-1'>Полная защищенность устройств.</p>
                      <p class='rt-font-small-paragraph'>Все мобильные устройства и конфиденциальная информация
                        надёжно защищены от вторжения посторонних лиц в корпоративные системы, информационную среду и
                        базы данных.</p>
                    </li>
                    <li class='rt-numeric-list__item'>
                      <p class='rt-font-small-paragraph sp-b-1'>Сертификация операционной системы «Аврора».</p>
                      <p class='rt-font-small-paragraph'>ОС Аврора внесена в единый реестр отечественного программного
                        обеспечения (№ 1543) ─ Сертификат ФСБ России АК1/КС1 и АК2/КС2, Сертификат ФСТЭК на платформу
                        управления и Сертификат ФСТЭК А4. Решение соответствует политике импортозамещения.</p>
                      <p class='rt-font-small-paragraph'>Набор сертификатов позволяет использовать ОС Аврора во всех
                        информационных системах, обрабатывающих конфиденциальную информацию с высокими требованиями
                        по защите информации. К ним относятся государственные информационные системы, обрабатывающие
                        персональные данные, а также особую категорию медицинских данных.</p>
                      <p class='rt-font-small-paragraph'>Соответствие требованиям уровням доверия ФСТЭК России означает
                        выполнение со стороны разработчика всех специализированных процедур анализа, тестирования,
                        документирования, а также проработку вопросов поддержки и обновления ПО.</p>
                    </li>
                    <li class='rt-numeric-list__item'>
                      <p class='rt-font-small-paragraph'>Стандартное мобильное место сотрудника.</p>
                      <ul class='rt-ordered-list sp-t-1'>
                        <li class='rt-ordered-list__item'>Защищенный доступ с мобильных устройств к ИС и БД</li>
                        <li class='rt-ordered-list__item'>Централизованное управление и администрирование устройств</li>
                        <li class='rt-ordered-list__item'>Удалённая работа с конфиденциальной информацией</li>
                      </ul>
                    </li>
                  </ul>
                </template>
              </rt-annotation>
            </div>"
            />
          <div class="rt-col-5"/>
        </div>
        <rt-annotation label="Примечание2" class="rt-space-top rt-space-bottom">
          <template slot="content">
            <div class="rt-numeric-list">
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Услуги Высокоскоростного интернета предоставляются при наличии
                технической возможности.
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Цены указаны в рублях с учетом НДС.
              </p>
              <p class="rt-annotation-item">
                «По оптической линии» — предоставление доступа к сети Интернет
                осуществляется по технологии FTTx (англ., fiber to the x —
                оптическое волокно до точки X) или по технологии PON (англ.
                Passive Optical Networks — пассивная оптическая сеть до
                абонента).
              </p>
              <p class="rt-annotation-item">
                «По телефонной линии» — предоставление доступа к сети Интернет
                осуществляется по технологии xDSL (англ., digital subscriber
                line, цифровая абонентская линия).
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Предоставление доступа к сети Интернет осуществляется по
                технологии xDSL (англ., digital subscriber line, цифровая
                абонентская линия).
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Скорость доступа к сети Интернет зависит не только от
                технических особенностей Услуги, но и от действий третьих сил,
                организаций и лиц, управляющих сегментами сети Интернет (или
                оказывающих на них влияние), не принадлежащих ПАО «Ростелеком».
                Скорость доступа к сети Интернет является величиной
                неопределенной и зависит от ряда параметров, в том числе,
                технических характеристик подключения, маршрута и текущей
                загрузки каналов, характеристиками установленного абонентского
                оборудования (ПК, смартфон, WiFi-роутер), версией программного
                обеспечения или используемого стандарта, месторасположением
                запрашиваемого контента. Все параметры являются переменными и не
                гарантируются ПАО «Ростелеком» за пределами своей сети.
                Указанная в тарифном плане скорость является максимально
                возможной.
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Абонентская плата за услугу Интернет списывается с лицевого
                счета абонента один раз в месяц. В первый месяц пользования
                услугой Интернет с лицевого счета абонента списывается
                абонентская плата, рассчитанная пропорционально количеству дней
                от даты начала оказания услуги до конца месяца.
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Оборудование (маршрутизатор или абонентский модем в зависимости
                от технологии предоставления услуги), необходимое для получения
                услуг, может быть приобретено отдельно по действующим тарифам.
                Стоимость оборудования уточняйте по телефону 8-800-100-0-800.
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Safe Kids — Сэйф кидс (перевод с англ. — Защищенные дети).
                Услуга предоставляется на территории Российской Федерации для
                абонентов-физических лиц при наличии технической возможности.
                При первом подключении услуги на условиях ежемесячной подписки
                первые 30 календарных дней с момента активации услуги
                предоставляются без взимания абонентской платы, далее согласно
                Базовым тарифам. При первом подключении услуги на условиях
                годовой подписки абонент пользуется услугой 14 месяцев (420
                календарных дней) с момента активации, два последних месяца
                предоставляются без взимания абонентской платы. При прологнации
                услуги или повторных подключениях на условиях годовой подписки
                период пользования составляет 360 календарных дней. Подробности
                об услуге, ПАО «Ростелеком» узнавайте по бесплатному номеру
                8-800-100-0-800, а также на сайте www.rt.ru.
              </p>
            </div>
          </template>
        </rt-annotation>
        <rt-annotation label="Примечание3" class="rt-space-top rt-space-bottom">
          <template slot="content">
            <div class="rt-numeric-list">
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Услуги Высокоскоростного интернета предоставляются при наличии
                технической возможности.
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Цены указаны в рублях с учетом НДС.
              </p>
              <p class="rt-annotation-item">
                «По оптической линии» — предоставление доступа к сети Интернет
                осуществляется по технологии FTTx (англ., fiber to the x —
                оптическое волокно до точки X) или по технологии PON (англ.
                Passive Optical Networks — пассивная оптическая сеть до
                абонента).
              </p>
              <p class="rt-annotation-item">
                «По телефонной линии» — предоставление доступа к сети Интернет
                осуществляется по технологии xDSL (англ., digital subscriber
                line, цифровая абонентская линия).
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Предоставление доступа к сети Интернет осуществляется по
                технологии xDSL (англ., digital subscriber line, цифровая
                абонентская линия).
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Скорость доступа к сети Интернет зависит не только от
                технических особенностей Услуги, но и от действий третьих сил,
                организаций и лиц, управляющих сегментами сети Интернет (или
                оказывающих на них влияние), не принадлежащих ПАО «Ростелеком».
                Скорость доступа к сети Интернет является величиной
                неопределенной и зависит от ряда параметров, в том числе,
                технических характеристик подключения, маршрута и текущей
                загрузки каналов, характеристиками установленного абонентского
                оборудования (ПК, смартфон, WiFi-роутер), версией программного
                обеспечения или используемого стандарта, месторасположением
                запрашиваемого контента. Все параметры являются переменными и не
                гарантируются ПАО «Ростелеком» за пределами своей сети.
                Указанная в тарифном плане скорость является максимально
                возможной.
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Абонентская плата за услугу Интернет списывается с лицевого
                счета абонента один раз в месяц. В первый месяц пользования
                услугой Интернет с лицевого счета абонента списывается
                абонентская плата, рассчитанная пропорционально количеству дней
                от даты начала оказания услуги до конца месяца.
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Оборудование (маршрутизатор или абонентский модем в зависимости
                от технологии предоставления услуги), необходимое для получения
                услуг, может быть приобретено отдельно по действующим тарифам.
                Стоимость оборудования уточняйте по телефону 8-800-100-0-800.
              </p>
              <p
                class="rt-annotation-item rt-numeric-list__item"
              >
                Safe Kids — Сэйф кидс (перевод с англ. — Защищенные дети).
                Услуга предоставляется на территории Российской Федерации для
                абонентов-физических лиц при наличии технической возможности.
                При первом подключении услуги на условиях ежемесячной подписки
                первые 30 календарных дней с момента активации услуги
                предоставляются без взимания абонентской платы, далее согласно
                Базовым тарифам. При первом подключении услуги на условиях
                годовой подписки абонент пользуется услугой 14 месяцев (420
                календарных дней) с момента активации, два последних месяца
                предоставляются без взимания абонентской платы. При прологнации
                услуги или повторных подключениях на условиях годовой подписки
                период пользования составляет 360 календарных дней. Подробности
                об услуге, ПАО «Ростелеком» узнавайте по бесплатному номеру
                8-800-100-0-800, а также на сайте www.rt.ru.
              </p>
            </div>
          </template>
        </rt-annotation>

        <documentation-builder :json="documentation" type="components" />
      </div>
    </div>
  </div>
</template>

<script>
// const componentsList = {};
import documentation from "@vue-rt-style-kit-atoms-local/components/Annotation/docs/index.json";
import componentsList from "../../componentsList";

export default {
  name: "AppButtons",
  components: componentsList,
  data: () => ({
    documentation: {}
  }),
  mounted() {
    this.documentation = documentation;
  },
  created() {},
  methods: {}
};
</script>
