<template>
  <div class="">
    <div class="wc-inline">
      <rt-video-banner
          preload-image="https://www.apple.com/v/airpods-max/c/images/overview/design_mesh__cleb6oo85bo2_xlarge.jpg"
          full-src="http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ElephantsDream.mp4"
          src="https://www.apple.com/105/media/us/airpods-max/2020/996b980b-3131-44f1-af6c-fe72f9b3bfb5/anim/supercut/large_2x.mp4">
        <template slot="content">
          <div class="md-color-block--dark-slate md-sp-t-1-2 md-sp-b-2 flex-fill">
            <div class="rt-container">
              <rt-col>
                <rt-row>
                  <rt-col :size="5" :tablet-size="3" :mobile-size="3" class="color-white">
                    <p class="sp-b-0-4 rt-font-label rt-font-label-uppercase color-white05">Умный дом</p>
                    <p class="font-h1 sp-b-0-4">Легко подключить, комфортно жить</p>
                    <p class="font-t-l sp-b-1-2">Готовые решения для умного дома</p>
                    <rt-button color="orange" class="rt-button-md--is-block">Подключить</rt-button>
                  </rt-col>
                </rt-row>
              </rt-col>
            </div>
          </div>
        </template>
      </rt-video-banner>
    </div>

    <div class="wc-inline">
      <div class="rt-container sp-b-5 td-sp-b-4 md-sp-b-3-1 tablet-border">
        <rt-col>
          <h2 class="font-h2 sp-b-2-2 td-sp-b-2 md-sp-b-1-3 md-sp-t-3-1 td-sp-t-4 sp-t-5">Умный дом от Ростелекома: <br>
            безопасно&nbsp;и&nbsp;удобно</h2>
          <rt-row>
            <rt-col :size="2" tablet-size="2" mobile-size="3" class="md-d-flex md-flex-v-center">
              <div class="flex-center-center md-d-block">
                <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg"
                     class="smart-icon">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40 80C62.0914 80 80 62.0914 80 40C80 17.9086 62.0914 0 40 0C17.9086 0 0 17.9086 0 40C0 62.0914 17.9086 80 40 80Z"
                        fill="#FF4F12"/>
                  <path
                      d="M54 38.25V40V59.25H26V40V38.25V36.5H24.25V59.25C24.25 60.2125 25.0375 61 26 61H54C54.9625 61 55.75 60.2125 55.75 59.25V36.5H54V38.25Z"
                      fill="white"/>
                  <path
                      d="M40.0004 19.0176L19.3154 36.0976L20.4354 37.4451L40.0004 21.2751L59.5654 37.4451L60.6854 36.0976L40.0004 19.0176Z"
                      fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M29.5 44.6551C29.5 44.2001 29.815 43.7976 30.2525 43.6751L32.125 43.1676C32.3175 42.4676 32.5975 41.7851 32.9475 41.1726L31.985 39.5101C31.7575 39.1076 31.8275 38.6176 32.1425 38.2851L33.0175 37.4101C33.21 37.2176 33.4725 37.1126 33.735 37.1126C33.91 37.1126 34.085 37.1651 34.2425 37.2526L35.9225 38.2151C36.535 37.8651 37.2175 37.5851 37.9175 37.3926L38.4075 35.5201C38.53 35.0826 38.9325 34.7676 39.3875 34.7676H40.63C41.085 34.7676 41.4875 35.0826 41.61 35.5201L42.1175 37.3751C42.8175 37.5676 43.5 37.8476 44.1125 38.1976L45.775 37.2351C45.9325 37.1476 46.1075 37.0951 46.2825 37.0951C46.545 37.0951 46.8075 37.2001 47 37.3926L47.875 38.2676C48.19 38.6001 48.26 39.0901 48.0325 39.4926L47.07 41.1551C47.4375 41.7676 47.7175 42.4326 47.91 43.1501L49.765 43.6401C50.2025 43.7626 50.5175 44.1651 50.5175 44.6201V45.8626C50.5175 46.3176 50.2025 46.7201 49.765 46.8426L47.91 47.3326C47.7175 48.0501 47.455 48.7151 47.0875 49.3451L48.05 51.0076C48.2775 51.4101 48.2075 51.9001 47.8925 52.2326L47.0175 53.1076C46.825 53.3001 46.5625 53.4051 46.3 53.4051C46.125 53.4051 45.95 53.3526 45.7925 53.2651L44.13 52.3026C43.5 52.6701 42.835 52.9501 42.1175 53.1426L41.6275 54.9976C41.505 55.4351 41.1025 55.7501 40.6475 55.7501H39.405C38.95 55.7501 38.5475 55.4351 38.425 54.9976L37.9175 53.1426C37.2 52.9501 36.535 52.6876 35.905 52.3201L34.2425 53.2826C34.085 53.3701 33.91 53.4226 33.735 53.4226C33.4725 53.4226 33.21 53.3176 33.0175 53.1251L32.1425 52.2501C31.8275 51.9176 31.7575 51.4276 31.985 51.0251L32.9475 49.3626C32.5975 48.7501 32.3175 48.0676 32.125 47.3676L30.2525 46.8776C29.815 46.7551 29.5 46.3526 29.5 45.8976V44.6551ZM33.6825 43.5701L33.4375 44.4801L32.545 44.7776L31.1275 45.1626V45.4776L32.545 45.8451L33.455 46.0901L33.7 47.0001C33.8575 47.5601 34.0675 48.1026 34.365 48.5926L34.8375 49.3976L34.365 50.2026L33.63 51.4626L33.8575 51.6901L35.1175 50.9551L35.9225 50.4826L36.7275 50.9551C37.235 51.2526 37.7775 51.4626 38.3375 51.6201L39.2475 51.8651L39.4925 52.7751L39.8775 54.1751H40.1925L40.56 52.7751L40.805 51.8651L41.715 51.6201C42.2925 51.4801 42.8175 51.2526 43.325 50.9551L44.13 50.4826L44.935 50.9551L46.195 51.6726L46.4225 51.4451L45.6875 50.1851L45.215 49.3801L45.6875 48.5751C45.985 48.0676 46.195 47.5251 46.3525 46.9651L46.5975 46.0551L47.5075 45.8101L48.9075 45.4251V45.1101L47.49 44.7426L46.58 44.4976L46.335 43.5876C46.195 43.0101 45.9675 42.4851 45.67 41.9776L45.1975 41.1726L45.67 40.3676L46.405 39.1076L46.1775 38.8801L44.9175 39.6151L44.1125 40.0876L43.3075 39.6151C42.8 39.3176 42.2575 39.0901 41.6975 38.9501L40.7875 38.7051L40.5425 37.7951L40.1575 36.3776H39.8425L39.475 37.7951L39.23 38.7051L38.32 38.9501C37.76 39.1076 37.2175 39.3176 36.7275 39.6151L35.9225 40.0876L35.1175 39.6151L33.84 38.8801L33.6125 39.1076L34.3475 40.3676L34.82 41.1726L34.3475 41.9776C34.05 42.4676 33.8225 43.0101 33.6825 43.5701Z"
                        fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M44.0954 45.2504C44.0954 47.5079 42.2754 49.3454 40.0179 49.3454C37.7604 49.3454 35.9229 47.5254 35.9229 45.2679C35.9229 43.0104 37.7429 41.1729 40.0004 41.1729C42.2579 41.1729 44.0954 42.9929 44.0954 45.2504ZM42.4679 45.2504C42.4679 43.8854 41.3654 42.7829 40.0004 42.7829C38.6354 42.7829 37.5329 43.9029 37.5329 45.2504C37.5329 46.6154 38.6354 47.7179 40.0004 47.7179C41.3654 47.7179 42.4679 46.6154 42.4679 45.2504Z"
                        fill="white"/>
                </svg>
              </div>
              <p class="font-t-l rt-font-center rt-font-md-left sp-t-1 md-sp-t-none md-sp-l-1">Легкая настройка за&nbsp;5&nbsp;минут
              </p>
            </rt-col>
            <rt-col :size="2" tablet-size="2" mobile-size="3" class="md-d-flex md-flex-v-center md-sp-t-1-3">
              <div class="flex-center-center md-d-block">
                <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg"
                     class="smart-icon">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40 80C62.0914 80 80 62.0914 80 40C80 17.9086 62.0914 0 40 0C17.9086 0 0 17.9086 0 40C0 62.0914 17.9086 80 40 80Z"
                        fill="#FF4F12"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M30.0875 19H54.4125C55.4275 19 56.25 19.8225 56.25 20.8375V59.1625C56.25 60.1775 55.4275 61 54.4125 61H30.0875C29.0725 61 28.25 60.1775 28.25 59.1625V20.8375C28.25 19.8225 29.0725 19 30.0875 19ZM54.5 20.8375C54.5 20.785 54.465 20.75 54.4125 20.75H30.0875C30.035 20.75 30 20.785 30 20.8375V59.1625C30 59.215 30.035 59.25 30.0875 59.25H54.4125C54.465 59.25 54.5 59.215 54.5 59.1625V20.8375Z"
                        fill="white"/>
                  <path
                      d="M42.25 57.5C42.7225 57.5 43.125 57.115 43.125 56.625C43.125 56.135 42.7225 55.75 42.25 55.75C41.7775 55.75 41.375 56.135 41.375 56.625C41.375 57.115 41.7775 57.5 42.25 57.5Z"
                      fill="white"/>
                  <rect x="28.25" y="52.25" width="28" height="1.75" fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M49.25 35.625L38.75 41.75V29.5L49.25 35.625ZM45.785 35.625L40.5 32.545V38.705L45.785 35.625Z"
                        fill="white"/>
                </svg>

              </div>
              <p class="font-t-l rt-font-center rt-font-md-left sp-t-1 md-sp-t-none md-sp-l-1">Удобное управление из&nbsp;приложения
              </p>
            </rt-col>
            <rt-col :size="2" tablet-size="2" mobile-size="3" class="md-d-flex md-flex-v-center md-sp-t-1-3">
              <div class="flex-center-center md-d-block">
                <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg"
                     class="smart-icon">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40.5 80C62.5914 80 80.5 62.0914 80.5 40C80.5 17.9086 62.5914 0 40.5 0C18.4086 0 0.5 17.9086 0.5 40C0.5 62.0914 18.4086 80 40.5 80Z"
                        fill="#FF4F12"/>
                  <rect x="42.1445" y="57.5" width="12.355" height="1.75" fill="white"/>
                  <rect x="26.6748" y="57.5" width="12.18" height="1.75" fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M37.9629 44.3574C37.9629 42.9049 39.1354 41.7324 40.5704 41.7324C42.0229 41.7324 43.1954 42.9224 43.1779 44.3574C43.1779 45.8099 42.0054 46.9824 40.5704 46.9824C39.1354 46.9824 37.9629 45.8099 37.9629 44.3574ZM41.4804 44.3574C41.4804 43.8674 41.0779 43.4824 40.6054 43.4824C40.1154 43.4824 39.7304 43.8849 39.7304 44.3574C39.7304 44.8474 40.1329 45.2324 40.6054 45.2324C41.0954 45.2324 41.4804 44.8474 41.4804 44.3574Z"
                        fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M35.3721 51.3574C35.3721 49.9049 36.5446 48.7324 37.9796 48.7324C39.4146 48.7324 40.5871 49.9224 40.5871 51.3574C40.5871 52.8099 39.4146 53.9824 37.9796 53.9824C36.5446 53.9824 35.3721 52.8099 35.3721 51.3574ZM38.8721 51.3574C38.8721 50.8674 38.4696 50.4824 37.9971 50.4824C37.5071 50.4824 37.1221 50.8849 37.1221 51.3574C37.1221 51.8474 37.5246 52.2324 37.9971 52.2324C38.4871 52.2324 38.8721 51.8474 38.8721 51.3574Z"
                        fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M38.0498 58.375C38.0498 56.9225 39.2223 55.75 40.6573 55.75C42.0923 55.75 43.2648 56.9225 43.2648 58.375C43.2648 59.8275 42.0923 61 40.6573 61C39.2223 61 38.0498 59.8275 38.0498 58.375ZM41.5498 58.375C41.5498 57.885 41.1473 57.5 40.6748 57.5C40.2023 57.5 39.7998 57.885 39.7998 58.375C39.7998 58.865 40.1848 59.25 40.6748 59.25C41.1648 59.25 41.5498 58.865 41.5498 58.375Z"
                        fill="white"/>
                  <rect x="42.3203" y="43.4824" width="12.18" height="1.75" fill="white"/>
                  <rect x="26.6748" y="43.4824" width="11.55" height="1.75" fill="white"/>
                  <rect x="39.3623" y="50.4824" width="15.1375" height="1.75" fill="white"/>
                  <rect x="26.6748" y="50.4824" width="9.38" height="1.75" fill="white"/>
                  <path
                      d="M36.1077 33.4372L34.8652 32.2122L35.4777 31.5822C36.8252 30.1997 38.6452 29.4297 40.5702 29.4297C42.4777 29.4297 44.2802 30.1822 45.6277 31.5472L46.2402 32.1772L44.9977 33.4022L44.3852 32.7897C42.3377 30.7072 38.7502 30.7247 36.7027 32.8247L36.1077 33.4372Z"
                      fill="white"/>
                  <path
                      d="M31.9954 29.9372L30.7529 28.7122L31.3654 28.0822C33.8154 25.5622 37.1054 24.1797 40.5879 24.1797C44.0529 24.1797 47.3079 25.5447 49.7579 28.0297L50.3704 28.6422L49.1454 29.8847L48.5329 29.2722C46.4154 27.1197 43.5979 25.9472 40.6054 25.9472C37.5779 25.9472 34.7429 27.1547 32.6079 29.3247L31.9954 29.9372Z"
                      fill="white"/>
                  <path
                      d="M27.7425 26.5075L26.5 25.2825L27.1125 24.6525C30.665 21.0125 35.4075 19 40.465 19C45.47 19 50.195 20.9775 53.73 24.565L54.3425 25.1775L53.1175 26.42L52.505 25.8075C49.285 22.5525 45.015 20.75 40.465 20.75C35.88 20.75 31.575 22.57 28.3375 25.895L27.7425 26.5075Z"
                      fill="white"/>
                </svg>

              </div>
              <p class="font-t-l rt-font-center rt-font-md-left sp-t-1 md-sp-t-none md-sp-l-1">Работает с интернетом
                любого провайдера

              </p>
            </rt-col>
            <rt-col :size="2" tablet-size="2" mobile-size="3" class="md-d-flex md-flex-v-center td-sp-t-2 md-sp-t-1-3">
              <div class="flex-center-center md-d-block">
                <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg"
                     class="smart-icon">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40.5 80C62.5914 80 80.5 62.0914 80.5 40C80.5 17.9086 62.5914 0 40.5 0C18.4086 0 0.5 17.9086 0.5 40C0.5 62.0914 18.4086 80 40.5 80Z"
                        fill="#FF4F12"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40.5 58.5C41.8807 58.5 43 57.3807 43 56C43 54.6193 41.8807 53.5 40.5 53.5C39.1193 53.5 38 54.6193 38 56C38 57.3807 39.1193 58.5 40.5 58.5ZM40.5 60C42.7091 60 44.5 58.2091 44.5 56C44.5 53.7909 42.7091 52 40.5 52C38.2909 52 36.5 53.7909 36.5 56C36.5 58.2091 38.2909 60 40.5 60Z"
                        fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40.7342 38.2493C37.5267 38.2493 34.522 39.1068 31.9338 40.6045L31.0498 39.0769C33.8994 37.4279 37.208 36.4844 40.7342 36.4844C44.0949 36.4844 47.2581 37.3414 50.0146 38.8495L49.1675 40.3979C46.6641 39.0282 43.7914 38.2493 40.7342 38.2493Z"
                        fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40.7341 30.0071C35.3781 30.0071 30.4099 31.6564 26.3058 34.475L25.3066 33.0202C29.6953 30.0061 35.0101 28.2422 40.7341 28.2422C46.2776 28.2422 51.4375 29.8966 55.744 32.7391L54.7718 34.2121C50.7448 31.5542 45.9214 30.0071 40.7341 30.0071Z"
                        fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40.7344 21.7649C33.1583 21.7649 26.1728 24.2837 20.5656 28.5304L19.5 27.1234C25.4032 22.6526 32.7604 20 40.7344 20C48.4985 20 55.6781 22.5149 61.5 26.7745L60.4579 28.1989C54.9281 24.153 48.1113 21.7649 40.7344 21.7649Z"
                        fill="white"/>
                </svg>

              </div>
              <p class="font-t-l rt-font-center rt-font-md-left sp-t-1 md-sp-t-none md-sp-l-1">Без проводов
              </p>
            </rt-col>
            <rt-col :size="2" tablet-size="2" mobile-size="3" class="md-d-flex md-flex-v-center td-sp-t-2 md-sp-t-1-3">
              <div class="flex-center-center md-d-block">
                <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg"
                     class="smart-icon">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40 80C62.0914 80 80 62.0914 80 40C80 17.9086 62.0914 0 40 0C17.9086 0 0 17.9086 0 40C0 62.0914 17.9086 80 40 80Z"
                        fill="#FF4F12"/>
                  <path d="M61.447 60.9997L47.832 49.3622L48.9695 48.0322L61.4995 58.7247L61.447 60.9997Z"
                        fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M19.5 36.5C19.5 26.84 27.34 19 37 19C46.66 19 54.5 26.84 54.5 36.5C54.5 46.16 46.66 54 37 54C27.34 54 19.5 46.16 19.5 36.5ZM52.75 36.5C52.75 27.82 45.68 20.75 37 20.75C28.32 20.75 21.25 27.82 21.25 36.5C21.25 45.18 28.32 52.25 37 52.25C45.68 52.25 52.75 45.18 52.75 36.5Z"
                        fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M33.5 45.25H35.25V38.25H39.555C42.005 38.25 44 36.255 44 33.805C44 31.425 42.075 29.5 39.695 29.5H33.5V36.5H31.75V38.25H33.5V45.25ZM39.555 36.5H35.25V31.25H39.695C41.095 31.25 42.25 32.3875 42.25 33.805C42.25 35.2925 41.0425 36.5 39.555 36.5Z"
                        fill="white"/>
                  <rect x="31.75" y="40" width="8.75" height="1.75" fill="white"/>
                </svg>

              </div>
              <p class="font-t-l rt-font-center rt-font-md-left sp-t-1 md-sp-t-none md-sp-l-1">Рассрочка для абонентов
                Ростелекома</p>
            </rt-col>
            <rt-col :size="2" tablet-size="2" mobile-size="3" class="md-d-flex md-flex-v-center td-sp-t-2 md-sp-t-1-3">
              <div class="flex-center-center md-d-block">
                <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg"
                     class="smart-icon">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40.5 80C62.5914 80 80.5 62.0914 80.5 40C80.5 17.9086 62.5914 0 40.5 0C18.4086 0 0.5 17.9086 0.5 40C0.5 62.0914 18.4086 80 40.5 80Z"
                        fill="#FF4F12"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M39.2575 19H41.7425C42.67 19 43.4575 19.6125 43.755 20.4525L44.7525 24.18C46.17 24.5475 47.5 25.1075 48.7425 25.825L52.0675 23.9C52.3825 23.7075 52.7325 23.62 53.0825 23.62C53.6075 23.62 54.1325 23.83 54.5175 24.215L56.285 25.9825C56.9325 26.63 57.055 27.645 56.6 28.4325L54.675 31.7575C55.3925 33 55.9525 34.3475 56.3375 35.765L60.0475 36.7625C60.94 37.0075 61.5525 37.8125 61.5525 38.7225V41.2075C61.5525 42.135 60.94 42.9225 60.0475 43.1675L56.3375 44.165C55.9525 45.6 55.3925 46.9475 54.675 48.19L56.6 51.515C57.0725 52.32 56.9325 53.3175 56.285 53.965L54.5175 55.7325C54.1325 56.1175 53.6075 56.3275 53.0825 56.3275C52.7325 56.3275 52.3825 56.2225 52.0675 56.0475L48.7425 54.1225C47.4825 54.8575 46.135 55.4 44.7175 55.785L43.72 59.495C43.475 60.3875 42.67 61 41.76 61H39.275C38.3475 61 37.56 60.3875 37.315 59.495L36.3175 55.785C34.9 55.4 33.5525 54.84 32.31 54.1225L28.985 56.0475C28.67 56.24 28.32 56.3275 27.97 56.3275C27.445 56.3275 26.92 56.1175 26.535 55.7325L24.7675 53.965C24.12 53.3175 23.9975 52.3025 24.4525 51.515L26.3775 48.19C25.66 46.965 25.1 45.6175 24.7325 44.2L21.005 43.2025C20.1125 42.9575 19.5 42.1525 19.5 41.2425V38.7575C19.5 37.83 20.1125 37.0425 21.005 36.815L24.7325 35.8175C25.1 34.4 25.66 33.07 26.3775 31.8275L24.4525 28.485C23.98 27.68 24.12 26.6825 24.7675 26.035L26.5175 24.2675C26.9025 23.8825 27.4275 23.6725 27.9525 23.6725C28.3025 23.6725 28.6525 23.7775 28.9675 23.9525L32.31 25.8775C33.5525 25.16 34.8825 24.6 36.3 24.2325L37.2975 20.505C37.5425 19.6125 38.3475 19 39.2575 19ZM42.005 20.96C41.97 20.8375 41.865 20.75 41.7425 20.75H39.2575C39.135 20.75 39.03 20.8375 38.995 20.925L37.9975 24.6525L37.735 25.6325L36.755 25.895C35.5125 26.2275 34.305 26.7175 33.2025 27.365L32.3275 27.8725L31.4525 27.365L28.11 25.44C28.099 25.4363 28.0888 25.4327 28.0791 25.4292C28.0421 25.416 28.0115 25.405 27.97 25.405C27.935 25.405 27.8475 25.4225 27.7775 25.4925L26.01 27.26C25.9225 27.3475 25.905 27.4875 25.975 27.61L27.9 30.9525L28.4075 31.8275L27.9 32.7025C27.2525 33.805 26.7625 34.995 26.43 36.255L26.1675 37.235L25.1875 37.4975L21.46 38.495C21.3375 38.53 21.25 38.635 21.25 38.7575V41.2425C21.25 41.365 21.3375 41.47 21.46 41.4875L25.1875 42.485L26.1675 42.7475L26.43 43.7275C26.7625 44.9875 27.2525 46.195 27.9 47.2975L28.4075 48.1725L27.9 49.0475L25.975 52.3725C25.905 52.4775 25.9225 52.6175 26.01 52.705L27.7775 54.4725C27.8475 54.5425 27.935 54.56 27.97 54.56C28.0225 54.56 28.075 54.5425 28.11 54.525L31.435 52.6L32.31 52.0925L33.185 52.6C34.2875 53.2475 35.495 53.755 36.755 54.0875L37.735 54.35L37.9975 55.33L38.995 59.04C39.03 59.1625 39.135 59.25 39.2575 59.25H41.7425C41.865 59.25 41.97 59.1625 41.9875 59.0925L42.985 55.3825L43.2475 54.4025L44.2275 54.14C45.4875 53.8075 46.695 53.3 47.815 52.6525L48.69 52.145L49.565 52.6525L52.89 54.5775C52.901 54.5812 52.9111 54.5848 52.9209 54.5883C52.9579 54.6015 52.9885 54.6125 53.03 54.6125C53.065 54.6125 53.1525 54.595 53.2225 54.525L54.99 52.7575C55.0775 52.67 55.095 52.53 55.025 52.425L53.1 49.1L52.5925 48.225L53.1 47.35C53.7475 46.23 54.255 45.0225 54.5875 43.7625L54.85 42.7825L55.83 42.52L59.54 41.5225C59.6625 41.4875 59.75 41.3825 59.75 41.26V38.775C59.75 38.6525 59.6625 38.5475 59.54 38.5125L55.83 37.515L54.85 37.2525L54.5875 36.2725C54.255 35.0125 53.7475 33.8225 53.1 32.7025L52.5925 31.8275L53.1 30.9525L55.025 27.6275C55.095 27.5225 55.0775 27.3825 54.99 27.295L53.2225 25.5275C53.1525 25.4575 53.065 25.44 53.03 25.44C52.9775 25.44 52.925 25.4575 52.89 25.475L49.565 27.4L48.69 27.9075L47.815 27.4C46.695 26.7525 45.505 26.2625 44.245 25.93L43.265 25.6675L43.0025 24.6875L42.005 20.96Z"
                        fill="white"/>
                  <path
                      d="M35.3028 33C36.7553 31.915 38.5403 31.25 40.5003 31.25C42.4603 31.25 44.2453 31.915 45.6978 33H48.3053C46.3803 30.865 43.5978 29.5 40.5003 29.5C37.4028 29.5 34.6203 30.865 32.6953 33H35.3028Z"
                      fill="white"/>
                  <path
                      d="M47.448 45.25C45.8555 47.3675 43.3355 48.75 40.5005 48.75C37.6655 48.75 35.1455 47.3675 33.553 45.25H31.418C33.238 48.3825 36.6155 50.5 40.5005 50.5C44.3855 50.5 47.763 48.3825 49.583 45.25H47.448Z"
                      fill="white"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M38.085 34.7324H39.835V39.9824H41.585V41.7499L39.835 41.7324V43.4824L38.085 43.4649V41.7324L34.585 41.7499V40.3674V39.9824L38.085 34.7324ZM38.0675 37.7074L36.5275 39.9824H38.0675V37.7074Z"
                        fill="white"/>
                  <path d="M47.0629 34.7324H45.3129L42.1104 43.4999H43.8429L47.0629 34.7324Z" fill="white"/>
                  <path
                      d="M53.1875 34.7324L47.9375 34.7499V36.4824L51.14 36.4999L47.955 43.4824H50.0025L53.17 36.4124L53.1875 34.7324Z"
                      fill="white"/>
                  <path
                      d="M30.7526 34.6973C28.8451 34.6973 27.8301 36.0623 27.8301 37.3398C27.8301 37.6198 27.8651 37.8648 27.9176 38.1273L27.9526 38.2673L29.7551 38.1273L29.7201 37.9523C29.6851 37.7773 29.6676 37.6373 29.6676 37.4098C29.6676 36.7798 30.0876 36.3948 30.7701 36.3948C31.4176 36.3948 31.8376 36.7973 31.8376 37.4273C31.8376 37.9348 31.6276 38.3198 30.9451 39.0198L27.8476 42.1698V43.5173H33.6226V41.7498H30.6476L32.1876 40.1923C33.2901 39.0898 33.6401 38.3723 33.6401 37.2523C33.6051 35.6948 32.4851 34.6973 30.7526 34.6973Z"
                      fill="white"/>
                </svg>

              </div>
              <p class="font-t-l rt-font-center rt-font-md-left sp-t-1 md-sp-t-none md-sp-l-1">Круглосуточная
                техническая поддержка</p>
            </rt-col>

          </rt-row>
        </rt-col>
      </div>
    </div>
    <div class="wc-inline">
      <div class="rt-container">
      <div class="rt-col">
        <div class="intetior">
          <p class="font-h2 intetior-label">Как устроен Умный дом</p>
          <img src="/static/images/smart/Intetior.jpg" alt="" class="intetior-image">
          <div :class="['buble', (coor.c[0]/width*100 < 55 ? 'buble-right' : 'buble-left')]" v-for="coor in coords"
               :style="{left: coor.c[0]/width*100+'%',top: coor.c[1]/height*100+'%'}">
            <rt-system-icons class="buble__icon" name="close large" color="white"></rt-system-icons>
            <div class="buble-popup sp-h-1 sp-v-1-1 round-border color-block--white rt-font-center">
              <img :src="coor.image" alt=""
                   class="buble-popup-image">
              <div class="sp-b-1">
                <p class="rt-font-h4 sp-b-0-3 sp-t-1">{{ coor.label }}</p>
                <p class="font-t-m color-main05-no-opacity" v-html="coor.text"></p>
              </div>
              <rt-button class="buble-button" :v-rt-scroll-to-on-click="{ 'scrollToId' : coor.scrollTo }"
                         :is-block="true" color="orange" :small="true">{{ coor.button }}
              </rt-button>
            </div>
          </div>

        </div>
      </div>
      </div>
    </div>
    <div class="wc-inline">
      <div class="homescript">
        <div class="rt-container sp-t-5 td-sp-t-2-2 md-sp-t-1-3">
          <rt-col>
            <h2 class="sp-t-1-3 rt-font-h2 sp-b-1">Сценарии Умного дома</h2>
            <p class="font-t-l">Задавайте любые сценарии действий Умному дому.</p>
            <p class="font-t-l sp-b-2">Устройства и датчики будут выполнять все ваши команды так, как удобно вам.</p>
            <div class="d-flex sp-b-3 md-d-none">
              <div class="d-flex flex-v-center">
                <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40 80C62.0914 80 80 62.0914 80 40C80 17.9086 62.0914 0 40 0C17.9086 0 0 17.9086 0 40C0 62.0914 17.9086 80 40 80Z"
                        fill="#E3E8EC"/>
                  <path
                      d="M54 38.25L54.0175 59.25L26 59.2675V40V38.25V36.5H24.25V59.2675C24.25 60.23 25.02 61 25.9825 61H54.035C54.98 61 55.7675 60.23 55.7675 59.2675V36.5H54.0175V38.25H54Z"
                      fill="#101828"/>
                  <path
                      d="M40.0004 19.0176L19.3154 36.0976L20.4354 37.4451L40.0004 21.2751L59.5654 37.4451L60.6854 36.0976L40.0004 19.0176Z"
                      fill="#101828"/>
                  <path
                      d="M43.64 46.7375C42.695 45.81 41.4175 45.25 40 45.25C38.5475 45.25 37.235 45.845 36.29 46.79L37.5325 48.0325C38.1625 47.385 39.0375 47 40 47C40.9275 47 41.785 47.3675 42.3975 47.9625L43.64 46.7375Z"
                      fill="#101828"/>
                  <path
                      d="M38.7578 49.2573L39.9303 50.4298L41.1553 49.2048C40.8578 48.9248 40.4553 48.7498 40.0003 48.7498C39.5103 48.7498 39.0728 48.9423 38.7578 49.2573Z"
                      fill="#101828"/>
                  <path
                      d="M46.1257 44.2525C44.5332 42.7125 42.3807 41.75 40.0007 41.75C37.5857 41.75 35.3982 42.73 33.8057 44.305L35.0482 45.5475C36.3257 44.2875 38.0757 43.5 40.0007 43.5C41.8907 43.5 43.6232 44.27 44.8832 45.495L46.1257 44.2525Z"
                      fill="#101828"/>
                </svg>

                <p class="sp-l-1-1 font-t-m color-main085-no-opacity">Настройте Умный дом под режим дня и <br>
                  привычки</p>
              </div>
              <div class="d-flex flex-v-center sp-l-1">
                <svg width="81" height="80" viewBox="0 0 81 80" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40.5 80C62.5914 80 80.5 62.0914 80.5 40C80.5 17.9086 62.5914 0 40.5 0C18.4086 0 0.5 17.9086 0.5 40C0.5 62.0914 18.4086 80 40.5 80Z"
                        fill="#E3E8EC"/>
                  <path
                      d="M54.5 38.25V40V59.25H26.5V40V38.25V36.5H24.75V59.25C24.75 60.2125 25.5375 61 26.5 61H54.5C55.4625 61 56.25 60.2125 56.25 59.25V36.5H54.5V38.25Z"
                      fill="#101828"/>
                  <path
                      d="M40.5004 19.0176L19.8154 36.0976L20.9354 37.4451L40.5004 21.2751L60.0654 37.4451L61.1854 36.0976L40.5004 19.0176Z"
                      fill="#101828"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M30 44.6551C30 44.2001 30.315 43.7976 30.7525 43.6751L32.625 43.1676C32.8175 42.4676 33.0975 41.7851 33.4475 41.1726L32.485 39.5101C32.2575 39.1076 32.3275 38.6176 32.6425 38.2851L33.5175 37.4101C33.71 37.2176 33.9725 37.1126 34.235 37.1126C34.41 37.1126 34.585 37.1651 34.7425 37.2526L36.4225 38.2151C37.035 37.8651 37.7175 37.5851 38.4175 37.3926L38.9075 35.5201C39.03 35.0826 39.4325 34.7676 39.8875 34.7676H41.13C41.585 34.7676 41.9875 35.0826 42.11 35.5201L42.6175 37.3751C43.3175 37.5676 44 37.8476 44.6125 38.1976L46.275 37.2351C46.4325 37.1476 46.6075 37.0951 46.7825 37.0951C47.045 37.0951 47.3075 37.2001 47.5 37.3926L48.375 38.2676C48.69 38.6001 48.76 39.0901 48.5325 39.4926L47.57 41.1551C47.9375 41.7676 48.2175 42.4326 48.41 43.1501L50.265 43.6401C50.7025 43.7626 51.0175 44.1651 51.0175 44.6201V45.8626C51.0175 46.3176 50.7025 46.7201 50.265 46.8426L48.41 47.3326C48.2175 48.0501 47.955 48.7151 47.5875 49.3451L48.55 51.0076C48.7775 51.4101 48.7075 51.9001 48.3925 52.2326L47.5175 53.1076C47.325 53.3001 47.0625 53.4051 46.8 53.4051C46.625 53.4051 46.45 53.3526 46.2925 53.2651L44.63 52.3026C44 52.6701 43.335 52.9501 42.6175 53.1426L42.1275 54.9976C42.005 55.4351 41.6025 55.7501 41.1475 55.7501H39.905C39.45 55.7501 39.0475 55.4351 38.925 54.9976L38.4175 53.1426C37.7 52.9501 37.035 52.6876 36.405 52.3201L34.7425 53.2826C34.585 53.3701 34.41 53.4226 34.235 53.4226C33.9725 53.4226 33.71 53.3176 33.5175 53.1251L32.6425 52.2501C32.3275 51.9176 32.2575 51.4276 32.485 51.0251L33.4475 49.3626C33.0975 48.7501 32.8175 48.0676 32.625 47.3676L30.7525 46.8776C30.315 46.7551 30 46.3526 30 45.8976V44.6551ZM34.1825 43.5701L33.9375 44.4801L33.045 44.7776L31.6275 45.1626V45.4776L33.045 45.8451L33.955 46.0901L34.2 47.0001C34.3575 47.5601 34.5675 48.1026 34.865 48.5926L35.3375 49.3976L34.865 50.2026L34.13 51.4626L34.3575 51.6901L35.6175 50.9551L36.4225 50.4826L37.2275 50.9551C37.735 51.2526 38.2775 51.4626 38.8375 51.6201L39.7475 51.8651L39.9925 52.7751L40.3775 54.1751H40.6925L41.06 52.7751L41.305 51.8651L42.215 51.6201C42.7925 51.4801 43.3175 51.2526 43.825 50.9551L44.63 50.4826L45.435 50.9551L46.695 51.6726L46.9225 51.4451L46.1875 50.1851L45.715 49.3801L46.1875 48.5751C46.485 48.0676 46.695 47.5251 46.8525 46.9651L47.0975 46.0551L48.0075 45.8101L49.4075 45.4251V45.1101L47.99 44.7426L47.08 44.4976L46.835 43.5876C46.695 43.0101 46.4675 42.4851 46.17 41.9776L45.6975 41.1726L46.17 40.3676L46.905 39.1076L46.6775 38.8801L45.4175 39.6151L44.6125 40.0876L43.8075 39.6151C43.3 39.3176 42.7575 39.0901 42.1975 38.9501L41.2875 38.7051L41.0425 37.7951L40.6575 36.3776H40.3425L39.975 37.7951L39.73 38.7051L38.82 38.9501C38.26 39.1076 37.7175 39.3176 37.2275 39.6151L36.4225 40.0876L35.6175 39.6151L34.34 38.8801L34.1125 39.1076L34.8475 40.3676L35.32 41.1726L34.8475 41.9776C34.55 42.4676 34.3225 43.0101 34.1825 43.5701Z"
                        fill="#101828"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M44.5954 45.2504C44.5954 47.5079 42.7754 49.3454 40.5179 49.3454C38.2604 49.3454 36.4229 47.5254 36.4229 45.2679C36.4229 43.0104 38.2429 41.1729 40.5004 41.1729C42.7579 41.1729 44.5954 42.9929 44.5954 45.2504ZM42.9679 45.2504C42.9679 43.8854 41.8654 42.7829 40.5004 42.7829C39.1354 42.7829 38.0329 43.9029 38.0329 45.2504C38.0329 46.6154 39.1354 47.7179 40.5004 47.7179C41.8654 47.7179 42.9679 46.6154 42.9679 45.2504Z"
                        fill="#101828"/>
                </svg>
                <p class="sp-l-1-1 font-t-m color-main085-no-opacity">Система запоминает все сценарии <br> действий
                </p>
              </div>
              <div class="d-flex flex-v-center sp-l-1">
                <svg width="80" height="80" viewBox="0 0 80 80" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M40 80C62.0914 80 80 62.0914 80 40C80 17.9086 62.0914 0 40 0C17.9086 0 0 17.9086 0 40C0 62.0914 17.9086 80 40 80Z"
                        fill="#E3E8EC"/>
                  <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M27.8375 19H52.1625C53.1775 19 54 19.8225 54 20.8375V59.1625C54 60.1775 53.1775 61 52.1625 61H27.8375C26.8225 61 26 60.1775 26 59.1625V20.8375C26 19.8225 26.8225 19 27.8375 19ZM52.25 20.8375C52.25 20.785 52.215 20.75 52.1625 20.75H27.8375C27.785 20.75 27.75 20.785 27.75 20.8375V59.1625C27.75 59.215 27.785 59.25 27.8375 59.25H52.1625C52.215 59.25 52.25 59.215 52.25 59.1625V20.8375Z"
                        fill="#101828"/>
                  <path
                      d="M40 57.5C40.4725 57.5 40.875 57.115 40.875 56.625C40.875 56.135 40.4725 55.75 40 55.75C39.5275 55.75 39.125 56.135 39.125 56.625C39.125 57.115 39.5275 57.5 40 57.5Z"
                      fill="#101828"/>
                  <rect x="26" y="52.25" width="28" height="1.75" fill="#101828"/>
                </svg>

                <p class="sp-l-1-1 font-t-m color-main085-no-opacity">Создавайте любые варианты <br> сценариев </p>

              </div>
            </div>
            <div class="homescript-slider">
              <div class="homescript-slider-images">

                <rt-img id="img1" src="/static/images/smart/img1.jpg" alt=""
                        class="homescript-image-main"></rt-img>
                <rt-img id="img2" src="/static/images/smart/img2.jpg" md-src="/static/images/smart/img2-md.jpg" alt=""
                        class="homescript-image"></rt-img>
                <rt-img id="img3" src="/static/images/smart/img3.jpg" md-src="/static/images/smart/img3-md.jpg" alt=""
                        class="homescript-image"></rt-img>
                <rt-img id="img4" src="/static/images/smart/img4.jpg" md-src="/static/images/smart/img4-md.jpg" alt=""
                        class="homescript-image"></rt-img>
                <rt-img id="img5" src="/static/images/smart/img5.jpg" md-src="/static/images/smart/img5-md.jpg" alt=""
                        class="homescript-image"></rt-img>

                <div class="homescript-slider-nav d-flex">
                  <div class="homescript-slider-block flex-fill">
                    <div class="homescript-slider-link">
                      <div class="homescript-header"><p class="font-h3">Я просыпаюсь</p>
                        <rt-system-icons name="arrow right" class="homescript-slider-back"
                                         color="white"></rt-system-icons>
                      </div>
                      <div class="homescript-body">
                        <p class="sp-t-1-2 homescript-body-text">Каждое утро в указанное время по сценарию Умного дома
                          с помощью датчика реле открываются шторы, включается умная розетка кофемашины, а умная
                          колонка «Маруся» включает музыку из вашего плейлиста.</p>
                        <div class="homescript-slider-go-back rt-sys-icon-hover--orange">
                          <rt-system-icons name="arrow left"
                                           color="white"></rt-system-icons>
                        </div>
                      </div>

                    </div>
                  </div>
                  <div class="homescript-slider-block flex-fill">
                    <div class="homescript-slider-link">
                      <div class="homescript-header"><p class="font-h3">Я смотрю кино</p>
                        <rt-system-icons name="arrow right" class="homescript-slider-back"
                                         color="white"></rt-system-icons>
                      </div>
                      <div class="homescript-body">
                        <p class="sp-t-1-2 homescript-body-text">Каждое утро в указанное время по сценарию Умного дома
                          с помощью датчика реле открываются шторы, включается умная розетка кофемашины, а умная
                          колонка «Маруся» включает музыку из вашего плейлиста.</p>
                        <div class="homescript-slider-go-back rt-sys-icon-hover--orange">
                          <rt-system-icons name="arrow left"
                                           color="white"></rt-system-icons>
                        </div>
                      </div>

                    </div>
                  </div>
                  <div class="homescript-slider-block flex-fill">
                    <div class="homescript-slider-link">
                      <div class="homescript-header"><p class="font-h3">Я дома</p>
                        <rt-system-icons name="arrow right" class="homescript-slider-back"
                                         color="white"></rt-system-icons>
                      </div>
                      <div class="homescript-body">
                        <p class="sp-t-1-2 homescript-body-text">Каждое утро в указанное время по сценарию Умного дома
                          с помощью датчика реле открываются шторы, включается умная розетка кофемашины, а умная
                          колонка «Маруся» включает музыку из вашего плейлиста.</p>
                        <div class="homescript-slider-go-back rt-sys-icon-hover--orange">
                          <rt-system-icons name="arrow left"
                                           color="white"></rt-system-icons>
                        </div>
                      </div>

                    </div>
                  </div>
                  <div class="homescript-slider-block flex-fill">
                    <div class="homescript-slider-link">
                      <div class="homescript-header"><p class="font-h3">Я в отпуске</p>
                        <rt-system-icons name="arrow right" class="homescript-slider-back"
                                         color="white"></rt-system-icons>
                      </div>
                      <div class="homescript-body">
                        <p class="sp-t-1-2 homescript-body-text">Каждое утро в указанное время по сценарию Умного дома
                          с помощью датчика реле открываются шторы, включается умная розетка кофемашины, а умная
                          колонка «Маруся» включает музыку из вашего плейлиста.</p>
                        <div class="homescript-slider-go-back rt-sys-icon-hover--orange">
                          <rt-system-icons name="arrow left"
                                           color="white"></rt-system-icons>
                        </div>
                      </div>

                    </div>
                  </div>
                </div>
              </div>
            </div>
          </rt-col>
        </div>


      </div>

    </div>
    <div class="wc-inline">
      <div class="color-block--main-color003-no-opacity sp-v-5 relative smart-phone-block td-sp-v-4 md-sp-t-3-1 md-sp-b-4-3">
        <div class="rt-container">
          <rt-col>
            <rt-row class="smart-phone-wrapper sp-t-2 sp-b-3 md-sp-b-none">
              <rt-col size="7" tablet-size="6" mobile-size="3" class="smart-pseudo"></rt-col>
              <rt-col size="5" tablet-size="4" mobile-size="3" class="relative rt-layer-level-2">
                <div class="sp-l-2 md-sp-l-none">
                  <p class="font-h2">Получайте подписку на сервис в подарок</p>
                  <p class="font-t-l sp-t-0-4 sp-b-1-2">При приобретении комплекта Умного дома за полную стоимость вы
                    получите 12 месяцев промо-периода. При покупке комплекта в рассрочку промо-период предоставляется на
                    24 месяца. </p>
                  <div class="d-flex">
                    <div class="color-orange sp-r-1 smart-line">
                      <rt-price :v2="true" :only-price="true" :value="0"></rt-price>
                      <p class="rt-font-control">При подключении</p>
                    </div>
                    <div class="sp-l-1">
                      <rt-price :v2="true" :value="350"></rt-price>
                      <p class="rt-font-control color-main07">После промо-периода</p>
                    </div>
                  </div>

                </div>
              </rt-col>
              <rt-col size="7" tablet-size="3" mobile-size="3" class="relative rt-layer-level-2 smart-phone-img">
                <img src="/static/images/smart/phone.png" alt="" class="smart-phone"/>
              </rt-col>
            </rt-row>
          </rt-col>
        </div>
      </div>
    </div>

  </div>

</template>
<!--ld-key-gray-->
<script>
// https://www.rt.ru/sites/default/files/img/videocontrol.04.2021/prize1.jpg
//     https://www.rt.ru/sites/default/files/img/videocontrol.04.2021/prize2.jpg
//         https://www.rt.ru/sites/default/files/img/videocontrol.04.2021/prize3.png

const componentsList = {};

export default {
  name: "AppPromoVip",
  components: componentsList,
  data: () => ({
    coords: [
      {
        c: [208, 230],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [47, 626],
        label: 'Датчик протечки Philio',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/aa.jpg',
        button: 'Хочу!',
        scrollTo: 'form'
      }, {
        c: [267, 326],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [328, 429],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [444, 590],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [663, 582],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [706, 472],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [731, 280],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [798, 173],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [888, 460],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [1306, 353],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      }, {
        c: [1319, 521],
        label: 'Датчик дыма',
        text: 'Фиксирует задымление в помещении <br/><br/>Датчик мгновенно обнаружит задымление и моментально отправит уведомление.',
        image: 'https://rt-static.rt.ru/sites/default/files/img/sensors/PHI_PSG01.jpg',
        button: 'Выбрать датчики',
        scrollTo: 'form'
      },
    ],
    width: 1440,
    height: 839
  }),
  mounted() {

    var init = function(){
      if(document.querySelectorAll('.homescript-image').length > 0 && document.querySelectorAll('.buble').length > 0){
        bind()
      }else{
        setTimeout(function (){
          init()
        },100)
      }
    }
    init()
    var bind = function () {
      var clickOutSide = function (e) {
        setTimeout(function () {
          if (e.target.classList && e.target.classList.contains('buble-active') || e.target.closest('.buble-active')) {
            if (document.querySelector('.buble-active')) {
              bindOutSideClick()
            }
          } else {
            document.querySelector('.buble-active').classList.remove('buble-active');
          }
        }, 10)
      }
      var keyPress = function (e) {
        if (e.code == 'Escape' && document.querySelector('.buble-active')) {
          document.querySelector('.buble-active').classList.remove('buble-active');
        }
      }
      var bindOutSideClick = function () {
        document.addEventListener('click', clickOutSide, {once: true})
      }
      var unbindOutSideClick = function () {
        document.removeEventListener('click', clickOutSide)
      }
      document.addEventListener('keydown', keyPress)
      document.querySelectorAll('.buble').forEach(function (item) {
        item.addEventListener('mouseleave', function (e) {
          if (!item.classList.contains('buble-blur') && !item.classList.contains('buble-active')) {
            item.classList.add('buble-blur')
            setTimeout(function () {
              item.classList.remove('buble-blur')
            }, 400)
          } else {

          }
        })
        item.addEventListener('click', function (e) {

          if (item.classList.contains('buble-active') && e.target.classList.contains('buble__icon') || e.target.classList.contains('buble-active') || e.target.classList.contains('buble-button') || e.target.closest('.buble-button')) {
            item.classList.remove('buble-active')
            unbindOutSideClick()
          } else {
            var anyB = document.querySelector('.buble-active');
            if (anyB) {
              anyB.classList.remove('buble-active')
            }
            item.classList.add('buble-active')
            setTimeout(function () {
              bindOutSideClick();
            })

          }

        })
      })
      document.querySelectorAll('.homescript-slider-link').forEach(function (item, index) {
        item.addEventListener('click', function (e) {
          if ((e.target.classList.contains('homescript-slider-go-back') || e.target.classList && e.target.closest('.homescript-slider-go-back')) && document.querySelector('.homescript-image-main--hide') && e.target.closest('.homescript-slider-block--active')) {
            document.querySelector('.homescript-image-main').classList.remove('homescript-image-main--hide')
            document.querySelector('.homescript-image--active').classList.remove('homescript-image--active')
            document.querySelector('.homescript-slider-block--active').classList.remove('homescript-slider-block--active')
            document.querySelector('.homescript-slider').classList.remove('homescript-slider--active')
          } else {
            document.querySelector('.homescript-image-main').classList.add('homescript-image-main--hide')
            var activeBlock = document.querySelector('.homescript-slider-block--active');
            if (activeBlock) {
              activeBlock.classList.remove('homescript-slider-block--active')
            }
            var activeImage = document.querySelector('.homescript-image--active');
            document.querySelector('.homescript-slider').classList.add('homescript-slider--active')
            if (activeImage) {
              activeImage.classList.remove('homescript-image--active')
            }
            document.querySelectorAll('.homescript-slider-block')[index].classList.add('homescript-slider-block--active')
            document.querySelectorAll('.homescript-image')[index].classList.add('homescript-image--active')
          }
        })
      })
    }


  }



};
</script>

