<template>
    <div>
        <div class="app-content">
            <div class="rt-container">
                <div class="app-title rt-col">
                    <h1 class="rt-font-hero">
                        Text Image Block
                    </h1>
                </div>
            </div>
            <div class="app-body">
                <pre-code text="
                    <rt-text-image-block title='28 символов с пробелами' image='https://static-cdn.rt.ru/sites/default/files/b2b/800_svg/Ddos-attacks1.jpg' bg-color='b2c-green'>
                        <template slot='upper-content'>
                            <p class='rt-font-small-paragraph sp-t-1 sp-b-2'>На краю дороги стоял дуб. Он был, вероятно, в
                            десять раз старше берез, составлявших лес, в десять раз толще и в два раза выше каждой березы.
                            Это был огромный, в два обхвата дуб. *</p>
                            <rt-button color='orange'>Кнопка</rt-button>
                        </template>
                        <template slot='footnote'>
                            <p class='rt-font-label color-main05'>* Если есть подсказка, то она прибита снизу блока на расстоянии 80 px</p>
                        </template>
                    </rt-text-image-block>"
                />
                <pre-code text="
                    <rt-text-image-block title='28 символов с пробелами' image='https://static-cdn.rt.ru/sites/default/files/b2b/800_svg/Ddos-attacks1.jpg' :reversed='true'>
                        <template slot='upper-content'>
                            <p class='rt-font-small-paragraph sp-t-1'>На краю дороги стоял дуб. Он был, вероятно,
                            в десять раз старше берез, составлявших лес, в десять раз толще и в два раза выше каждой
                            березы. Это был огромный, в два обхвата дуб, с обломанными суками и корой, заросшей старыми
                            болячками. С огромными, неуклюже, несимметрично растопыренными корявыми руками и пальцами,
                            он старым, сердитым  и презрительным уродом стоял между улыбающимися березами. Только он
                            один не хотел подчиниться обаянию весны и не хотел видеть ни весны, ни солнца.</p>
                            <p class='rt-font-small-paragraph'>Этот дуб как будто говорил: «Весна, и любовь,
                            и счастье! И как не надоест вам все один и тот же глупый, бессмысленный обман! Все одно и
                            то же, и все обман! Нет ни весны, ни солнца, ни счастья.</p>
                        </template>
                        <template slot='footnote'>
                            <p class='rt-font-label color-main05'>* Если есть подсказка, то она прибита снизу блока на расстоянии 80 px</p>
                        </template>
                    </rt-text-image-block>"
                />
                <pre-code text="
                    <rt-text-image-block image='https://static-cdn.rt.ru/sites/default/files/b2b/800_svg/Ddos-attacks1.jpg' bg-color='b2c-yellow' :tight-text='true'>
                        <template slot='title'>Максимум 60 символов <br>с пробелами для заголовка <br>в 3 строки</template>
                        <template slot='upper-content'>
                            <p class='rt-font-small-paragraph sp-t-1'>На краю дороги стоял дуб. Он был, вероятно, в десять раз
                            старше берез, составлявших лес, в десять раз толще и в два раза выше каждой березы. Это был
                            огромный, в два обхвата дуб. *</p>
                            <ul class='rt-ordered-list sp-t-1 sp-b-2'>
                                <li class='rt-ordered-list__item rt-font-paragraph'>На краю дороги стоял дуб.</li>
                                <li class='rt-ordered-list__item rt-font-paragraph'>Это был огромный, в два обхвата дуб.</li>
                                <li class='rt-ordered-list__item rt-font-paragraph'>Этот дуб как будто говорил: «Весна,
                                и любовь, и счастье! И как не надоест вам все один и тот же глупый, бессмысленный обман!</li>
                            </ul>
                            <rt-price :v2='true' :value='7150'/>
                        </template>
                    </rt-text-image-block>"
                />
                <pre-code text="
                    <rt-text-image-block image='https://static-cdn.rt.ru/sites/default/files/b2b/800_svg/Ddos-attacks1.jpg' :reversed='true' :tight-text='true'>
                        <template slot='title'>Заголовок</template>
                        <template slot='upper-content'>
                            <p class='rt-font-small-paragraph sp-t-1'>Этот дуб как будто говорил: «Весна, и любовь, и счастье!
                            И как не надоест вам все один и тот же глупый, бессмысленный обман!</p>
                            <rt-benefit-block :columns-quantity='2' :is-nested='true' :has-icon='true' icon-size='56px'>
                                <rt-benefit-item>
                                    <template slot='image'>
                                        <svg width='56' height='56' viewBox='0 0 56 56' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                            <path d='M42 26.25L42.0175 47.25L14 47.2675V28V26.25V24.5H12.25V47.2675C12.25 48.23 13.02 49 13.9825 49H42.035C42.98 49 43.7675 48.23 43.7675 47.2675V24.5H42.0175V26.25H42Z' fill='#101828'/>
                                            <path d='M28.0004 7.01758L7.31543 24.0976L8.43543 25.4451L28.0004 9.27508L47.5654 25.4451L48.6854 24.0976L28.0004 7.01758Z' fill='#101828'/>
                                            <path d='M31.64 34.7375C30.695 33.81 29.4175 33.25 28 33.25C26.5475 33.25 25.235 33.845 24.29 34.79L25.5325 36.0325C26.1625 35.385 27.0375 35 28 35C28.9275 35 29.785 35.3675 30.3975 35.9625L31.64 34.7375Z' fill='#101828'/>
                                            <path d='M26.7578 37.2576L27.9303 38.4301L29.1553 37.2051C28.8578 36.9251 28.4553 36.7501 28.0003 36.7501C27.5103 36.7501 27.0728 36.9426 26.7578 37.2576Z' fill='#101828'/>
                                            <path d='M34.1257 32.2525C32.5332 30.7125 30.3807 29.75 28.0007 29.75C25.5857 29.75 23.3982 30.73 21.8057 32.305L23.0482 33.5475C24.3257 32.2875 26.0757 31.5 28.0007 31.5C29.8907 31.5 31.6232 32.27 32.8832 33.495L34.1257 32.2525Z' fill='#101828'/>
                                        </svg>
                                    </template>
                                    <template slot='description'>
                                        <p class='rt-font-small-paragraph'>На краю дороги стоял дуб. Он был, вероятно, в десять раз старше берез.</p>
                                    </template>
                                </rt-benefit-item>
                                <rt-benefit-item>
                                    <template slot='image'>
                                        <svg width='56' height='56' viewBox='0 0 56 56' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                            <path d='M42 26.25V28V47.25H14V28V26.25V24.5H12.25V47.25C12.25 48.2125 13.0375 49 14 49H42C42.9625 49 43.75 48.2125 43.75 47.25V24.5H42V26.25Z' fill='#101828'/>
                                            <path d='M28.0004 7.01758L7.31543 24.0976L8.43543 25.4451L28.0004 9.27508L47.5654 25.4451L48.6854 24.0976L28.0004 7.01758Z' fill='#101828'/>
                                            <path fill-rule='evenodd' clip-rule='evenodd' d='M17.5 32.6551C17.5 32.2001 17.815 31.7976 18.2525 31.6751L20.125 31.1676C20.3175 30.4676 20.5975 29.7851 20.9475 29.1726L19.985 27.5101C19.7575 27.1076 19.8275 26.6176 20.1425 26.2851L21.0175 25.4101C21.21 25.2176 21.4725 25.1126 21.735 25.1126C21.91 25.1126 22.085 25.1651 22.2425 25.2526L23.9225 26.2151C24.535 25.8651 25.2175 25.5851 25.9175 25.3926L26.4075 23.5201C26.53 23.0826 26.9325 22.7676 27.3875 22.7676H28.63C29.085 22.7676 29.4875 23.0826 29.61 23.5201L30.1175 25.3751C30.8175 25.5676 31.5 25.8476 32.1125 26.1976L33.775 25.2351C33.9325 25.1476 34.1075 25.0951 34.2825 25.0951C34.545 25.0951 34.8075 25.2001 35 25.3926L35.875 26.2676C36.19 26.6001 36.26 27.0901 36.0325 27.4926L35.07 29.1551C35.4375 29.7676 35.7175 30.4326 35.91 31.1501L37.765 31.6401C38.2025 31.7626 38.5175 32.1651 38.5175 32.6201V33.8626C38.5175 34.3176 38.2025 34.7201 37.765 34.8426L35.91 35.3326C35.7175 36.0501 35.455 36.7151 35.0875 37.3451L36.05 39.0076C36.2775 39.4101 36.2075 39.9001 35.8925 40.2326L35.0175 41.1076C34.825 41.3001 34.5625 41.4051 34.3 41.4051C34.125 41.4051 33.95 41.3526 33.7925 41.2651L32.13 40.3026C31.5 40.6701 30.835 40.9501 30.1175 41.1426L29.6275 42.9976C29.505 43.4351 29.1025 43.7501 28.6475 43.7501H27.405C26.95 43.7501 26.5475 43.4351 26.425 42.9976L25.9175 41.1426C25.2 40.9501 24.535 40.6876 23.905 40.3201L22.2425 41.2826C22.085 41.3701 21.91 41.4226 21.735 41.4226C21.4725 41.4226 21.21 41.3176 21.0175 41.1251L20.1425 40.2501C19.8275 39.9176 19.7575 39.4276 19.985 39.0251L20.9475 37.3626C20.5975 36.7501 20.3175 36.0676 20.125 35.3676L18.2525 34.8776C17.815 34.7551 17.5 34.3526 17.5 33.8976V32.6551ZM21.6825 31.5701L21.4375 32.4801L20.545 32.7776L19.1275 33.1626V33.4776L20.545 33.8451L21.455 34.0901L21.7 35.0001C21.8575 35.5601 22.0675 36.1026 22.365 36.5926L22.8375 37.3976L22.365 38.2026L21.63 39.4626L21.8575 39.6901L23.1175 38.9551L23.9225 38.4826L24.7275 38.9551C25.235 39.2526 25.7775 39.4626 26.3375 39.6201L27.2475 39.8651L27.4925 40.7751L27.8775 42.1751H28.1925L28.56 40.7751L28.805 39.8651L29.715 39.6201C30.2925 39.4801 30.8175 39.2526 31.325 38.9551L32.13 38.4826L32.935 38.9551L34.195 39.6726L34.4225 39.4451L33.6875 38.1851L33.215 37.3801L33.6875 36.5751C33.985 36.0676 34.195 35.5251 34.3525 34.9651L34.5975 34.0551L35.5075 33.8101L36.9075 33.4251V33.1101L35.49 32.7426L34.58 32.4976L34.335 31.5876C34.195 31.0101 33.9675 30.4851 33.67 29.9776L33.1975 29.1726L33.67 28.3676L34.405 27.1076L34.1775 26.8801L32.9175 27.6151L32.1125 28.0876L31.3075 27.6151C30.8 27.3176 30.2575 27.0901 29.6975 26.9501L28.7875 26.7051L28.5425 25.7951L28.1575 24.3776H27.8425L27.475 25.7951L27.23 26.7051L26.32 26.9501C25.76 27.1076 25.2175 27.3176 24.7275 27.6151L23.9225 28.0876L23.1175 27.6151L21.84 26.8801L21.6125 27.1076L22.3475 28.3676L22.82 29.1726L22.3475 29.9776C22.05 30.4676 21.8225 31.0101 21.6825 31.5701Z' fill='#101828'/>
                                            <path fill-rule='evenodd' clip-rule='evenodd' d='M32.0954 33.2501C32.0954 35.5076 30.2754 37.3451 28.0179 37.3451C25.7604 37.3451 23.9229 35.5251 23.9229 33.2676C23.9229 31.0101 25.7429 29.1726 28.0004 29.1726C30.2579 29.1726 32.0954 30.9926 32.0954 33.2501ZM30.4679 33.2501C30.4679 31.8851 29.3654 30.7826 28.0004 30.7826C26.6354 30.7826 25.5329 31.9026 25.5329 33.2501C25.5329 34.6151 26.6354 35.7176 28.0004 35.7176C29.3654 35.7176 30.4679 34.6151 30.4679 33.2501Z' fill='#101828'/>
                                        </svg>
                                    </template>
                                    <template slot='description'>
                                        <p class='rt-font-small-paragraph'>Это был огромный, в два обхвата дуб, заросшей старыми болячками.</p>
                                    </template>
                                </rt-benefit-item>
                                <rt-benefit-item>
                                    <template slot='image'>
                                        <svg width='56' height='56' viewBox='0 0 56 56' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                            <path fill-rule='evenodd' clip-rule='evenodd' d='M17.5 17.5C17.5 11.7075 22.2075 7 28 7C33.7925 7 38.5 11.7075 38.5 17.5C38.5 23.2925 33.7925 28 28 28C22.2075 28 17.5 23.2925 17.5 17.5ZM36.75 17.5C36.75 12.67 32.83 8.75 28 8.75C23.17 8.75 19.25 12.67 19.25 17.5C19.25 22.33 23.17 26.25 28 26.25C32.83 26.25 36.75 22.33 36.75 17.5Z' fill='#101828'/>
                                            <path d='M12.25 49V38.5C12.25 35.6125 14.6125 33.25 17.5 33.25H38.5C41.3875 33.25 43.75 35.6125 43.75 38.5V49H45.5V38.5C45.5 34.6325 42.3675 31.5 38.5 31.5H17.5C13.6325 31.5 10.5 34.6325 10.5 38.5V49H12.25Z' fill='#101828'/>
                                        </svg>
                                    </template>
                                    <template slot='description'>
                                        <p class='rt-font-small-paragraph'>С огромными, корявыми руками и пальцами, он сердитым уродом стоял.</p>
                                    </template>
                                </rt-benefit-item>
                                <rt-benefit-item>
                                    <template slot='image'>
                                        <svg width='56' height='56' viewBox='0 0 56 56' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                            <path d='M37.5902 41.02C37.0827 41.335 36.5577 41.615 36.0327 41.8775L37.8177 47.25H18.1827L19.9677 41.8775C19.4252 41.615 18.9177 41.335 18.4102 41.02L16.5202 46.69C16.1352 47.8275 16.9752 49 18.1827 49H37.8352C39.0252 49 39.8652 47.8275 39.4977 46.69L37.5902 41.02Z' fill='#101828'/>
                                            <path fill-rule='evenodd' clip-rule='evenodd' d='M9.625 25.375C9.625 15.225 17.85 7 28 7C38.15 7 46.375 15.225 46.375 25.375C46.375 35.525 38.15 43.75 28 43.75C17.85 43.75 9.625 35.525 9.625 25.375ZM44.625 25.375C44.625 16.205 37.17 8.75 28 8.75C18.83 8.75 11.375 16.205 11.375 25.375C11.375 34.545 18.83 42 28 42C37.17 42 44.625 34.545 44.625 25.375Z' fill='#101828'/>
                                            <path d='M28 15.75C28.49 15.75 28.875 15.365 28.875 14.875C28.875 14.385 28.49 14 28 14C27.51 14 27.125 14.385 27.125 14.875C27.125 15.365 27.51 15.75 28 15.75Z' fill='#101828'/>
                                            <path fill-rule='evenodd' clip-rule='evenodd' d='M26.9321 26.4075C27.2821 26.3025 27.6496 26.25 27.9996 26.25C29.4871 26.25 30.8696 27.195 31.3421 28.7C31.9196 30.5375 30.9046 32.515 29.0671 33.0925C28.7171 33.1975 28.3496 33.25 27.9996 33.25C26.5121 33.25 25.1296 32.305 24.6571 30.8C24.0796 28.9625 25.0946 26.985 26.9321 26.4075ZM29.6621 29.225C29.4346 28.49 28.7696 28 27.9996 28C27.8246 28 27.6496 28.035 27.4746 28.0875C27.0196 28.2275 26.6521 28.525 26.4421 28.945C26.2321 29.3475 26.1971 29.8375 26.3371 30.275C26.5646 31.01 27.2296 31.5 27.9996 31.5C28.1746 31.5 28.3496 31.465 28.5246 31.4125C28.9796 31.2725 29.3471 30.975 29.5571 30.555C29.7671 30.1525 29.8021 29.6625 29.6621 29.225Z' fill='#101828'/>
                                            <path fill-rule='evenodd' clip-rule='evenodd' d='M19.25 29.75C19.25 24.92 23.17 21 28 21C32.83 21 36.75 24.92 36.75 29.75C36.75 34.58 32.83 38.5 28 38.5C23.17 38.5 19.25 34.58 19.25 29.75ZM35 29.75C35 25.8825 31.8675 22.75 28 22.75C24.1325 22.75 21 25.8825 21 29.75C21 33.6175 24.1325 36.75 28 36.75C31.8675 36.75 35 33.6175 35 29.75Z' fill='#101828'/>
                                        </svg>
                                    </template>
                                    <template slot='description'>
                                        <p class='rt-font-small-paragraph'>На краю дороги стоял дуб. Он был, вероятно, в десять раз старше берез.</p>
                                    </template>
                                </rt-benefit-item>
                            </rt-benefit-block>
                        </template>
                    </rt-text-image-block>"
                />
                <rt-text-image-block title="Блок с видео" image="https://static-cdn.rt.ru/sites/default/files/b2b/800_svg/Ddos-attacks1.jpg" bg-color="b2c-pink" video="D406lgoxLxY">
                    <template slot="upper-content">
                        <p class="rt-font-small-paragraph sp-t-2 sp-b-0-4">Много-много-много-много-много-много-много-много-много-много-много-много-много-много-много очень-очень много текста</p>
                        <p class="rt-font-small-paragraph sp-b-2">Много-много-много-много-много-много-много-много очень-очень много текста</p>
                        <rt-button class="rt-button-cool-grey-border">Подписаться</rt-button>
                    </template>
                    <template slot="footnote">
                    </template>
                </rt-text-image-block>
                <div class="sp-t-5-4"/>
                <div class="sp-t-5-4"/>
            </div>
        </div>

        <div class="rt-container rt-space-top25">
            <documentation-builder :json="documentation" type="components"/>
        </div>
    </div>
</template>

<script>
    import documentation from "@vue-rt-style-kit-molecules-local/components/TextImageBlock/docs/index.json";
    import componentsList from "../../componentsList";
    //  const componentsList = {};
    export default {
        name: "AppTextImageBlock",
        components: componentsList,
        data: () => ({
            documentation: {}
        }),
        mounted() {
            this.documentation = documentation;
        },
        created() {},
        methods: {}
    };
</script>
